In [294]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error
from sklearn.preprocessing import LabelEncoder, OneHotEncoder,StandardScaler
from sklearn.metrics import mean_squared_error, r2_score

In [295]:
arr = pd.DataFrame(np.random.randn(1000, 2), columns=['Feature1', 'Feature2'])

In [296]:
print(arr.head())

   Feature1  Feature2
0 -0.430690 -0.253300
1  0.526377 -0.444168
2 -1.541348 -1.433284
3  2.867110  0.736498
4 -0.694945 -1.833847

In [297]:
features = arr[['Feature1']]
target = arr['Feature2']

In [298]:
print(features.head())

   Feature1
0 -0.430690
1  0.526377
2 -1.541348
3  2.867110
4 -0.694945

In [299]:
arr = np.array(['cat', 'dog', 'fish', 'cat', 'dog', 'fish', 'cat', 'dog', 'fish'])

In [300]:
le = LabelEncoder()

In [301]:
model = le.fit_transform(arr)

In [302]:
print (model)

[0 1 2 0 1 2 0 1 2]

In [303]:
arr1 = pd.DataFrame({
    "Animal Name" : arr,
    "encoded Animal": model
})

In [304]:
arr1

  Animal Name  encoded Animal
0         cat               0
1         dog               1
2        fish               2
3         cat               0
4         dog               1
5        fish               2
6         cat               0
7         dog               1
8        fish               2

In [305]:
city_data = pd.DataFrame({
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'New York', 'Chicago', 'Houston'],
    'Temperature': [85, 75, 80, 90, 100, 82, 78, 88]})

In [306]:
city_data.count()

City           8
Temperature    8
dtype: int64

In [307]:
ohw = OneHotEncoder()

In [308]:
city_encoded = ohw.fit_transform(city_data[['City']]).toarray()

In [309]:
city_encoded

array([[0., 0., 0., 1., 0.],
       [0., 0., 1., 0., 0.],
       [1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 1.],
       [0., 0., 0., 1., 0.],
       [1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.]])

In [310]:
# city_data.map(city_encoded)

In [311]:
df = pd.read_csv("deepseek_csv_student_marks.csv")

In [312]:
df.head(10)

   student_id  study_hours      city country  test_score passed
0           1          2.5  New York     USA          72     No
1           2          5.8    London      UK          88    Yes
2           3          1.2     Tokyo   Japan          65     No
3           4          3.7     Paris  France          78    Yes
4           5          6.5  New York     USA          92    Yes
5           6          2.1     Tokyo   Japan          58     No
6           7          4.3    London      UK          85    Yes
7           8          0.8    Mumbai   India          52     No
8           9          7.2     Paris  France          95    Yes
9          10          3.0  New York     USA          71     No

In [313]:
city_count = df["city"].unique()
print(city_count)
city_count.size

['New York' 'London' 'Tokyo' 'Paris' 'Mumbai' 'Berlin']

6

In [314]:
country_count = df["country"].unique()
print(country_count)
country_count.size

['USA' 'UK' 'Japan' 'France' 'India' 'Germany']

6

In [315]:
df["city_endcoded"] = le.fit_transform(df["city"])
df["country_encoded"] = le.fit_transform(df["country"])

In [316]:
df.head()

,student_id,study_hours,city,country,test_score,passed,city_endcoded,country_encoded
0,1,2.5,New York,USA,72,No,3,5
1,2,5.8,London,UK,88,Yes,1,4
2,3,1.2,Tokyo,Japan,65,No,5,3
3,4,3.7,Paris,France,78,Yes,4,0
4,5,6.5,New York,USA,92,Yes,3,5

In [317]:
df.head()

,student_id,study_hours,city,country,test_score,passed,city_endcoded,country_encoded
0,1,2.5,New York,USA,72,No,3,5
1,2,5.8,London,UK,88,Yes,1,4
2,3,1.2,Tokyo,Japan,65,No,5,3
3,4,3.7,Paris,France,78,Yes,4,0
4,5,6.5,New York,USA,92,Yes,3,5

In [318]:
ss =   StandardScaler()

In [319]:
# df["study_hours_scaled"] = ss.fit_transform(df[["study_hours"]])
# df["test_score_scaled"] = ss.fit_transform(df[["test_score"]])

df[["study_hours_scaled", "test_score_scaled"]] = ss.fit_transform(df[["study_hours", "test_score"]])

In [320]:
df.head()

,student_id,study_hours,city,country,test_score,passed,city_endcoded,country_encoded,study_hours_scaled,test_score_scaled
0,1,2.5,New York,USA,72,No,3,5,-0.694832,-0.326329
1,2,5.8,London,UK,88,Yes,1,4,1.096531,0.931808
2,3,1.2,Tokyo,Japan,65,No,5,3,-1.400520,-0.876764
3,4,3.7,Paris,France,78,Yes,4,0,-0.043427,0.145472
4,5,6.5,New York,USA,92,Yes,3,5,1.476517,1.246342

In [321]:
df["passed"] =  le.fit_transform(df["passed"])

In [322]:
df

,student_id,study_hours,city,country,test_score,passed,city_endcoded,country_encoded,study_hours_scaled,test_score_scaled
0,1,2.5,New York,USA,72,0,3,5,-0.694832,-0.326329
1,2,5.8,London,UK,88,1,1,4,1.096531,0.931808
2,3,1.2,Tokyo,Japan,65,0,5,3,-1.400520,-0.876764
3,4,3.7,Paris,France,78,1,4,0,-0.043427,0.145472
4,5,6.5,New York,USA,92,1,3,5,1.476517,1.246342
5,6,2.1,Tokyo,Japan,58,0,5,3,-0.911967,-1.427200
6,7,4.3,London,UK,85,1,1,4,0.282275,0.695907
7,8,0.8,Mumbai,India,52,0,2,2,-1.617655,-1.899001
8,9,7.2,Paris,France,95,1,4,0,1.856504,1.482243
9,10,3.0,New York,USA,71,0,3,5,-0.423413,-0.404963
10,11,4.8,Berlin,Germany,82,1,0,1,0.553694,0.460006
11,12,2.3,Mumbai,India,63,0,2,2,-0.803399,-1.034032
12,13,5.5,London,UK,89,1,1,4,0.933680,1.010442
13,14,1.5,Tokyo,Japan,59,0,5,3,-1.237669,-1.348566
14,15,6.1,Berlin,Germany,91,1,0,1,1.259383,1.167709
15,16,2.8,Paris,France,74,1,4,0,-0.531981,-0.169062
16,17,3.9,New York,USA,79,1,3,5,0.065140,0.224106
17,18,4.5,London,UK,83,1,1,4,0.390843,0.538640
18,19,1.9,Mumbai,India,60,0,2,2,-1.020534,-1.269932
19,20,5.2,Berlin,Germany,87,1,0,1,0.770829,0.853174

In [323]:
df[['study_hours_scaled', 'test_score_scaled', 'passed']].corr()

                    study_hours_scaled  test_score_scaled    passed
study_hours_scaled            1.000000           0.962040  0.827722
test_score_scaled             0.962040           1.000000  0.876385
passed                        0.827722           0.876385  1.000000

In [324]:
X = df[["study_hours", "test_score"]]
y = df["passed"]

In [325]:
x_train ,x_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [326]:
print("train data shape:", x_train)
print("test data shape:", x_test)

train data shape:     study_hours  test_score
8           7.2          95
5           2.1          58
11          2.3          63
3           3.7          78
18          1.9          60
16          3.9          79
13          1.5          59
2           1.2          65
9           3.0          71
19          5.2          87
4           6.5          92
12          5.5          89
7           0.8          52
10          4.8          82
14          6.1          91
6           4.3          85
test data shape:     study_hours  test_score
0           2.5          72
17          4.5          83
15          2.8          74
1           5.8          88

In [327]:
lr = LinearRegression()

In [328]:
model = lr.fit(x_train,y_train)

In [329]:
y_pred = lr.predict(x_test)

In [330]:
print("MSE:", mean_squared_error(y_test, y_pred))
print("R2:", r2_score(y_test, y_pred))

MSE: 0.11728032843757431
R2: 0.3745049149996037

In [331]:
# # import matplotlib.pyplot as plt

# # plt.scatter(x_test.values.flatten(), y_test.values, color='blue', label='Actual')
# # plt.plot(x_test.values.flatten(), y_pred, color='red', label='Predicted')
# # plt.xlabel('Study Hours (scaled)')
# # plt.ylabel('Test Score (scaled)')
# # plt.legend()
# # plt.show()


# plt.scatter(x_test.values.flatten(), y_test.values, color='blue', label='Actual')
# plt.plot(x_test.values.flatten(), y_pred, color='red', label='Predicted')
# plt.xlabel('Study Hours (scaled)')
# plt.ylabel('Test Score (scaled)')
# plt.legend()
# plt.show()

In [332]:
from sklearn.linear_model import LogisticRegression

log_model = LogisticRegression()
log_model.fit(x_train, y_train)
y_pred_class = log_model.predict(x_test)  # 0 or 1

In [333]:
new_student = pd.DataFrame({
    "study_hours": [9.5], 
    "test_score": [47]
})

prediction = log_model.predict(new_student)
print("Passed?" , prediction[0])  # 0 = No, 1 = Yes

Passed? 0